<script setup lang="ts">
import PHome from '@/pages/home'

// если мы хотим чтобы роут динамически менялся, то нам надо использовать app.vue в корне проекта
// и роутинг будет ссылаться на папку pages
// если роуты будут создаваться вручную,
// то необходимо прописывать вручную каждый роут и добавлять туда страницу
// layouts работают и так и так, но есть недостаток - <Suspense/> по дефолту работать не будет
</script>

<template>
  <NuxtLayout name="home">
    <PHome />
  </NuxtLayout>
</template>
